backend/app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "gift_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 57], ["gift_id", 1], ["created_at", "2021-06-07 21:57:44.746513"], ["updated_at", "2021-06-07 21:57:44.746513"]]
---
    def create
        favorite = Favorite.new(favorite_params)
        # current_user.favorite.build(favorite_params)
        if favorite.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def index
        user_id = params[:user_id]
        user = User.find(user_id)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 5]]
---
    def destroy
        fav_id = params[:id]
        favorite = Favorite.find(fav_id)
        favorite.destroy