backend/app/controllers/users_controller.rb

  def create
      user = User.find_or_create_by(email: params[:user][:email])
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "fhfhg"], ["password_digest", "$2a$12$FJy8zQoF6BDvS6/en00mPuxSr9CRxu.g0U46qHPV9deWZODE4VX5i"], ["created_at", "2021-03-31 22:52:56.674142"], ["updated_at", "2021-03-31 22:52:56.674142"]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Hannah"], ["LIMIT", 1]]